Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/types_of_employment/index.html.txt.tmx
Source language: en
Languages: ga

source: An outline of the different types of employment and how this can affect your employment rights
ga: Tá cur síos anseo ar chineálacha difriúla fostaíochta agus ar an éifeacht atá acu ar do chearta fostaíochta

source: Domestic workers' employment rights
ga: Cearta fostaíochta oibrithe tí

source: Who is a domestic worker?
ga: Cad is oibrí tí ann?

source: Outline of the employment rights of people working in private homes
ga: Sracthuairisc ar chearta fostaíochta daoine a oibríonn i dtithe príobháideacha

source: Agency workers have rights under certain employment legislation
ga: Tá cearta ag oibrithe gníomhaireacht faoi reachtaíocht fostaíochta áirithe

source: Find out more about these and the Protection of Employees (Temporary Agency Work) Act 2012
ga: Faigh amach tuilleadh fúthu seo agus faoin Acht um Chosaint Fostaithe (Obair Ghníomhaireachta Shealadach) 2012

source: A definition of what a part-time worker is, an overview of part-time workers and explanation of the difference between a part-time worker and a casual worker
ga: Míniú ar céard is oibrí páirtaimseartha, léargas ginearálta ar oibrithe páirtaimseartha agus léiriú ar an difear idir oibrí páirtaimseartha agus oibrí ócáideach

source: Employment rights of part-time workers
ga: Cearta fostaíochta fostaithe páirtaimseartha

source: Part-time workers have certain employment rights under the Protection of Employees (Part-Time Work) Act 2001
ga: Tá cearta fostaíochta áirithe ag oibrithe páirtaimseartha faoin tAcht um Chosaint Fostaithe (Obair Pháirtaimseartha) 2001

source: Most Read in "Employment"
ga: Ábhar is mó éilimh i "Fostaíocht"

source: Rest periods and breaks
ga: Tréimhsí sosa agus sosanna

source: Tax and starting work - PAYE
ga: Gnó a chur ar bun
